tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
brew "act"
brew "coreutils"
brew "asdf"
brew "awscli"
brew "bat"
brew "cmake"
brew "curl"
brew "direnv"
brew "docker-completion"
brew "exa"
brew "gawk"
brew "git"
brew "glow"
brew "gnupg"
brew "go"
brew "jq"
brew "mas"
brew "tmux"
brew "vim"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "aws-vault"
cask "chatgpt"
cask "discord"
cask "figma"
cask "font-ricty-diminished"
cask "font-ubuntu-mono-nerd-font"
cask "google-drive"
cask "hashicorp-vagrant"
cask "iterm2"
cask "kindle"
cask "notion"
cask "obsidian"
cask "raycast"
cask "slack"
cask "swiftformat-for-xcode"
cask "visual-studio-code"
mas "1Password 7", id: 1333542190
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
