tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "jesseduffield/lazygit"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "leoafarias/fvm"
brew "act"
brew "coreutils"
brew "openssl@3"
brew "asdf"
brew "awscli"
brew "bat"
brew "bitwarden-cli"
brew "chezmoi"
brew "cloudflared"
brew "cmake"
brew "curl"
brew "direnv"
brew "exa"
brew "ffmpeg"
brew "gawk"
brew "gh"
brew "git"
brew "glow"
brew "gnupg"
brew "go"
brew "htop"
brew "jq"
brew "lima"
brew "mas"
brew "mkcert"
brew "neovim"
brew "ollama"
brew "prettyping"
brew "qemu"
brew "ripgrep"
brew "tailscale"
brew "tldr"
brew "tmux"
brew "tree"
brew "vim"
brew "yt-dlp"
brew "jesseduffield/lazygit/lazygit"
brew "leoafarias/fvm/fvm"
cask "arc"
cask "aws-vault"
cask "bitwarden"
cask "chatgpt"
cask "cloudflare-warp"
cask "cursor"
cask "discord"
cask "docker"
cask "figma"
cask "font-ricty-diminished"
cask "font-ubuntu-mono-nerd-font"
cask "godot"
cask "google-chrome"
cask "google-drive"
cask "google-japanese-ime"
cask "hashicorp-vagrant"
cask "iterm2"
cask "karabiner-elements"
cask "kindle"
cask "notion"
cask "obsidian"
cask "postman"
cask "raspberry-pi-imager"
cask "raycast"
cask "slack"
cask "spotify"
cask "swiftformat-for-xcode"
cask "tor-browser"
cask "utm"
cask "visual-studio-code"
cask "warp"
mas "1Password 7", id: 1333542190
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
